// api/fakeApi.ts
export type BookPreviewData = {
  id: string;
  title: string;
  author: string;
  price: number;
  cover: string;
  department: string;
  publication_date: number; 
  
};

export type BookDetailsData = BookPreviewData & {
  description: string;
  publication_date: number;
  inStock: boolean;
  pages:number;
  format: string;
  upc: string;
  publisher: string;
};

const fakeBooks: BookDetailsData[] = [
  {
    id: "1",
    title: "Коррекция нарушений связной речи у детей",
    author: "Арсеньева М. В. Ивлева М. Г.",
    price: 945,
    cover: `${import.meta.env.BASE_URL}coverbook1.jpg`,   
    department: "коррекционная педагогика",
    description: "Пособие предназначено для студентов, обучающихся по направлению 44.03.03 Специальное (дефектологическое) образование, направленность (профиль) 'Логопедия (Начальное образование детей с нарушениями речи)'. Представлены темы для изучения на практических занятиях, обозначено их основное содержание, приведен перечень заданий к каждой теме, списки литературы, средства оценки знаний по изученным темам.",
    publication_date: 2023,
    inStock: true,
    pages: 300,
    format: "172x290 мм",
    upc: "978-5-17-98649-4",
    publisher: "Herzen книги",
  },
  
  {
    id: "2",
    title: "Жизнь номер один",
    author: "Липовецкий О.",
    price: 950,
    cover: `${import.meta.env.BASE_URL}coverbook2.jpg`,   
    department: "спорт",
    description: "Взросление — самый непростой период в жизни человека, в который все случается впервые, а поэтому воспринимается остро и ярко. Первая любовь и попытки отвоевать свое место под солнцем, ощутить собственную силу, обрести голос и воспоминания — задачи не из легких, но любящая семья, друзья и враги помогут герою на этом важнейшем этапе становления. ",
    publication_date: 2022,
    inStock: true,
    pages: 300,
    format: "172x290 мм",
    upc: "978-5-17-98649-4",
    publisher: "ИД Городец"


  },
   {
    id: "3",
    title: "Наречие в вепсском языке",
    author: "И. В. Бродский",
    price: 945,
    cover: `${import.meta.env.BASE_URL}coverbook3.jpg`,   
    department: "институт севера",
    description: "Пособие предназначено для студентов, обучающихся по направлению 44.03.03 Специальное (дефектологическое) образование, направленность (профиль) 'Логопедия (Начальное образование детей с нарушениями речи)'. Представлены темы для изучения на практических занятиях, обозначено их основное содержание, приведен перечень заданий к каждой теме, списки литературы, средства оценки знаний по изученным темам.",
    publication_date: 2023,
    inStock: true,
    pages: 300,
    format: "172x290 мм",
    upc: "978-5-17-98649-4",
    publisher: "Herzen книги"

  },
  {
    id: "4",
    title: "Древний языкв генезисе философских понятий",
    author: "Петр Петров",
    price: 950,
    cover: `${import.meta.env.BASE_URL}coverbook4.jpg`,   
    department: "философия",
    description: "Материалы, представленные в пособии, всесторонне отражают содержание дисциплины Древний язык в генезисе философских понятий. Углубленному изучению предмета способствуют терминологические словари. Учебное пособие предназначено для студентов-бакалавров дневного и заочного отделений, обучающихся по специальности Философия (направление философская антропология). Пособие может быть полезным также магистрантам и аспирантам, специализирующимся в области философии и смежных гуманитарных наук.",
    publication_date: 2022,
    inStock: true,
    pages: 300,
    format: "172x290 мм",
    upc: "978-5-17-98649-4",
    publisher: "Herzen книги"

  },
  {
    id: "5",
    title: "Художественный текстиль роспись по ткани",
    author: "Петр Петров",
    price: 950,
    cover: `${import.meta.env.BASE_URL}coverbook5.jpg`,   
    department: "художественное образование",
    description: "Настоящее издание представляет собой учебно-методическое пособие к основной образовательной программе. Приведен пример преподавания в вузе росписи по ткани и варианты выполнения практического задания. В исторической справке отмечено значение Ленинградской школы художественного текстиля в процессе совершенствования технологии батика. Теоретический материал дополнен иллюстрациями. Учебно-методическое пособие отражает специфику преподавания дисциплины на кафедре декоративного искусства и дизайна и апробировано в учебном процессе. Издание адресовано педагогам и студентам.",
    publication_date: 2022,
    inStock: true,
    pages: 300,
    format: "172x290 мм",
    upc: "978-5-17-98649-4",
    publisher: "Herzen книги"

  }
  ,
  {
    id: "6",
    title: "Традиции института народов Севера",
    author: "Петр Петров",
    price: 950,
    cover: `${import.meta.env.BASE_URL}coverbook6.jpg`,   
    department: "институт севера",
    description: "Продвинутые техники TypeScriptсемгншигзргнесексмищт...",
    publication_date: 2022,
    inStock: true,
    pages: 300,
    format: "172x290 мм",
    upc: "978-5-17-98649-4",
    publisher: "Herzen книги"

  },
  {
    id: "7",
    title: "Основы медицинских знаний и здорового образа жизни",
    author: "Сыромятникова Л. И. Никитина Е. С. ",
    price: 630,
    cover: `${import.meta.env.BASE_URL}coverbook7.jpg`,   
    department: "медицина",
    description: "Продвинутые техники TypeScriptсемгншигзргнесексмищт...",
    publication_date: 2025,
    inStock: false,
    pages: 430,
    format: "172x290 мм",
    upc: "978-5-17-98649-4",
    publisher: "Herzen книги"
  }
  ,
  {
    id: "8",
    title: "Русская речь в 21 веке",
    author: "Гончарова Е. И. Игнатьева Н. Д.Сидорова Е. Ю",
    price: 950,
    cover: `${import.meta.env.BASE_URL}coverbook8.jpg`,   
    department: "филология",
    description: "Учебное пособие Русская речь в 21 веке подготовлено с целью формирования у иностранных студентов знаний о живых процессах русской разговорной речи, о языковых явлениях, характерных для русского языка в XXI веке, активизации навыков устной речи и совершенствования коммуникативной компетенции учащихся. Пособие адресовано широкому кругу иностранных учащихся: слушателям краткосрочных курсов среднего и продвинутого уровней владения русским языком; студентам, обучающимся по специальностям ",
    publication_date: 2022,
    inStock: false,
    pages: 300,
    format: "172x290 мм",
    upc: "978-5-17-98649-4",
    publisher: "Herzen книги"
  }
  ,
  {
    id: "9",
    title: "Названия традиционных продуктов питания в корякском языке: монография",
    author: "Петр Плосков",
    price: 350,
    cover: `${import.meta.env.BASE_URL}coverbook9.jpg`,   
    department: "институт севера",
    description: "Предмет исследования представляет значительный интерес как с теоретической, так и с практической точек зрения. С одной стороны, анализ лексики тесно связан с вопросами социально-культурной обусловленности языка, этнической языковой картины мира, с проблемами словообразования, с другой - сопрягается с лексикографической практикой. При описании современного состояния исследуемого пласта лексики сделана попытка показать устойчивость и динамику корякского словарного запаса, использование его в речи коряков. Исследование предназначено для языковедов, этнографов, культурологов, учителей и учащихся средних школ Крайнего Севера, Сибири и Дальнего Востока Российской Федерации, студентов колледжей, высших учебных заведений и для всех интересующихся языком и культурой коряков.",
    publication_date: 2022,
    inStock: false,
    pages: 300,
    format: "172x290 мм",
    upc: "978-5-17-98649-4",
    publisher: "Herzen книги"

  }
];

export const getBookPreviews = (): Promise<BookPreviewData[]> => {
  return Promise.resolve(
    fakeBooks.map(({ 
      id, 
      title, 
      author, 
      price, 
      cover, 
      department,
      publication_date,
      inStock 
    }) => ({
      id, 
      title, 
      author, 
      price, 
      cover, 
      department,
      publication_date,
      inStock  // Включаем в возвращаемый объект
    }))
  );
};

export const getBookDetails = (id: string): Promise<BookDetailsData | undefined> => {
  return Promise.resolve(fakeBooks.find(book => book.id === id));
};